$item_list = [
    {
        "name"=> "メガホン",
        "value"=> 320,
        "ex"=> "拡声器　声量によるダメージ増加",
        "effect"=> {
            "attack"=> 20
        }
    },

    {
        "name"=> "学生服",
        "value"=> 900,
        "ex"=> "身だしなみに必要　挨拶の効果UP",
        "effect"=> {
            "hp"=> 10,
            "attack"=> 10,
            "mp"=> 10,
            "block"=> 10
        }
    },

    {
        "name"=> "科章",
        "value"=> 500,
        "ex"=> "服　敵の攻撃をちょっとだけ防ぐ",
        "effect"=> {
            "attack"=> 10,
            "block"=> 5
        }
    },

    {
        "name"=> "欠点界の最高点",
        "value"=> 500,
        "ex"=> "保体の49.5点の答案　効果なし笑",
        "effect"=> {}
    },

    {
        "name"=> "寮食",
        "value"=> 300,
        "ex"=> "味はまずいが体力を回復させる",
        "effect"=> {
            "hp"=> 40
        }
    },

    {
        "name"=> "学生証",
        "value"=> 200,
        "ex"=> "これがないと、学割が効かない",
        "effect"=> {
            "hp"=> 15,
            "mp"=> 15,
            "block"=> 15
        }
    },

    {
        "name"=> "単位",
        "value"=> 500,
        "ex"=> "卒業に必要　みんな欲しがる",
        "effect"=> {
            "hp"=> 30,
            "attack"=> 30,
            "mp"=> 30,
            "block"=> 30
        }
    },
    
    {
        "name"=> "ウルトラメガホン",
        "value"=> 1000,
        "ex"=> "拡声器　ダメージが大幅UP",
        "effect"=> {
            "attack"=> 70
        }
    },

    {
        "name"=> "やさC ",
        "value"=> 2500,
        "ex"=> "C言語用の教科書 ちゃんと読もう",
        "effect"=> {
            "attack"=> 40,
            "mp"=> 30,
            "block"=> 25
        }
    },

    {
        "name"=> "伝説の剣",
        "value"=> 2500,
        "ex"=> "王がくれた剣　なくしたら買おう",
        "effect"=> {
            "attack"=> 90
        }
    },

    {
        "name"=> "伝説の鎧",
        "value"=> 2500,
        "ex"=> "絶対防御の伝説の品",
        "effect"=> {
            "block"=> 90
        }
    },

    {
        "name"=> "伝説のメガホン",
        "value"=> 2500,
        "ex"=> "伝説級の声量で相手を倒す",
        "effect"=> {
            "attack"=> 300
        }
    }
]
